const config = require('../config')
const { cmd, commands } = require('../command');
const path = require('path'); 
const os = require("os")
const fs = require('fs');
const {runtime} = require('../lib/functions')
const axios = require('axios')

cmd({
    pattern: "menu",
    alias: ["allmenu","fullmenu"],
    use: '.menu',
    desc: "Show all bot commands",
    category: "menu",
    react: "📜",
    filename: __filename
}, 
async (conn, mek, m, { from, quoted, body, isCmd, command, args, q, isGroup, sender, senderNumber, botNumber2, botNumber, pushname, isMe, isOwner, groupMetadata, groupName, participants, groupAdmins, isBotAdmins, isAdmins, reply }) => {
    try {
        let dec = `‎‎*╭─══════════════⊷❍*
‎*┋❁┋. ʙᴏᴛ ɴᴀᴍᴇ: ʀᴀʜᴍᴀɴ-ᴍᴅ*
‎*┋❁┋. ᴠᴇʀꜱɪᴏɴ: 4.0.0*
‎*┋❁┋. ᴏᴡɴᴇʀ : ʀᴀʜᴍᴀɴ ᴛᴇᴄʜ*      
‎*┋❁┋. ɴᴜᴍʙᴇʀ: 923015954782*
‎*┋❁┋. ᴘʟᴀᴛғᴏʀᴍ: ${os.platform()}*
‎*┋❁┋. ᴍᴏᴅᴇ: ${mode}*
‎*┋❁┋. ᴘʀᴇғɪx: [${config.PREFIX}]*
‎*┋❁╰───────────────*
‎*╰═════════════════⍟*
‎
‎*╭─❍ 𝙳𝙾𝚆𝙽𝙻𝙾𝙰𝙳 ══════⊷❍*
‎*┋❀┃. ᴛɪᴋᴛᴏᴋ*
‎*┋❀┃. ғᴀᴄᴇʙᴏᴏᴋ*
‎*┋❀┃. ᴀᴘᴋ*
‎*┋❀┃. ɪɴsᴛᴀ*
‎*┋❀┃. ᴛᴡɪᴛᴛᴇʀ*
‎*┋❀┃. ᴘʟᴀʏ*
‎*┋❀┃. ᴘʟᴀʏ2*
‎*┋❀┃. ᴘɪɴᴛᴇʀᴇsᴛ*
‎*┋❀┃. sᴘᴏᴛɪғʏ*
‎*┋❀┃. ᴀᴜᴅɪᴏ*
‎*┋❀┃. ᴠɪᴅᴇᴏ*
‎*┋❀┃. ᴠɪᴅᴇᴏ2*
‎*┋❀┃. ʏᴛᴍᴘ4*
‎*┋❀┃. ᴍᴇᴅɪᴀғɪʀᴇ*
‎*┋❀┃. ɢᴅʀɪᴠᴇ*
‎*┋❀┃. ᴛɪᴋs*
‎*┋❀┃. ssᴡᴇʙ*
‎*┋❀┃. ᴅᴀʀᴀᴍᴀ*
‎*┋❀╰────────────────*
‎*╰══════════════════⍟*
‎
‎*╭─❍ 𝙻𝙾𝙶𝙾 𝙼𝙰𝙺𝙴𝚁 ══════⊷❍*
‎*┋❀┃. ᴅʀᴀɢᴏɴʙᴀʟʟ*
‎*┋❀┃. ʙʟᴀᴄᴋᴘɪɴᴋ*
‎*┋❀┃. ɴᴇᴏɴʟɪɢʜᴛ*
‎*┋❀┃. sᴀᴅɢɪʀʟ*
‎*┋❀┃. ɴᴀʀᴜᴛᴏ*
‎*┋❀┃. 3ᴅᴄᴏᴍɪᴄ*
‎*┋❀┃. 3ᴅᴘᴀᴘᴇʀ*
‎*┋❀┃. ғᴜᴛᴜʀɪsᴛɪᴄ*
‎*┋❀┃. ᴄʟᴏᴜᴅs*
‎*┋❀┃. ʟᴇᴀғ*
‎*┋❀┃. ᴇʀᴀsᴇʀ*
‎*┋❀┃. sᴜɴsᴇᴛ*
‎*┋❀┃. ɢᴀʟᴀxʏ*
‎*┋❀┃. sᴀɴs*
‎*┋❀┃. ʙᴏᴏᴍ*
‎*┋❀┃. ʜᴀᴄᴋᴇʀ*
‎*┋❀┃. ᴅᴇᴠɪʟᴡɪɴɢs*
‎*┋❀┃. ɴɪɢᴇʀɪᴀ*
‎*┋❀┃. ʙᴜʟʙ*
‎*┋❀┃. ᴀɴɢᴇʟᴡɪɴɢs*
‎*┋❀┃. ᴢᴏᴅɪᴀᴄ*
‎*┋❀┃. ʟᴜxᴜʀʏ*
‎*┋❀┃. ᴘᴀɪɴᴛ*
‎*┋❀┃. ғʀᴏᴢᴇɴ*
‎*┋❀┃. ᴄᴀsᴛʟᴇ*
‎*┋❀┃. ᴛᴀᴛᴏᴏ*
‎*┋❀┃. ᴠᴀʟᴏʀᴀɴᴛ*
‎*┋❀┃. ʙᴇᴀʀ*
‎*┋❀┃. ᴛʏᴘᴏɢʀᴀᴘʜʏ*
‎*┋❀┃. ʙɪʀᴛʜᴅᴀʏ*
‎*┋❀╰────────────────*
‎*╰══════════════════⍟*
‎
‎*╭─❍ 𝙼𝙰𝙸𝙽 ══════════⊷❍*
‎*┋❀┃. ᴍᴇɴᴜ*
‎*┋❀┃. ᴏᴡɴᴇʀ*
‎*┋❀┃. ʟɪsᴛᴄᴍᴅ*
‎*┋❀┃. ʀᴇᴘᴏ*
‎*┋❀┃. ʙʟᴏᴄᴋ*
‎*┋❀┃. ᴜɴʙʟᴏᴄᴋ*
‎*┋❀┃. ʀᴇsᴛᴀʀᴛ*
‎*┋❀┃. ғᴜʟʟᴘᴘ*
‎*┋❀┃. sᴇᴛᴘᴘ*
‎*┋❀┃. ᴀʟɪᴠᴇ*
‎*┋❀┃. ᴜᴘᴅᴀᴛᴇᴄᴍᴅ*
‎*┋❀┃. sʜᴜᴛᴅᴏᴡɴ*
‎*┋❀┃. ᴊɪᴅ*
‎*┋❀┃. ᴘɪɴɢ* 
‎*┋❀┃. ɢᴊɪᴅ*
‎*┋❀┃. sᴇᴛᴘᴘ*
‎*┋❀╰───────────────*
‎*╰═════════════════⍟*
‎
‎*╭─❍ 𝙾𝚃𝙷𝙴𝚁 ═════════⊷❍*
‎*┋❀┃. ᴀʟɪᴠᴇ*
‎*┋❀┃. ʟɪᴠᴇ*
‎*┋❀┃. sᴘᴇᴇᴅ*
‎*┋❀┃. ʀᴇᴘᴏ*
‎*┋❀┃. ᴜᴘᴛɪᴍᴇ*
‎*┋❀┃. ʀᴜɴᴛɪᴍᴇ*
‎*┋❀┃. ᴛɪᴍᴇɴᴏᴡ*
‎*┋❀┃. ᴄᴀʟᴄᴜʟᴀᴛᴇ*
‎*┋❀┃. ᴄᴏᴜɴᴛ*
‎*┋❀┃. ᴅᴀᴛᴇ*
‎*┋❀┃. ᴄᴘᴘ*
‎*┋❀┃. ғᴀᴄᴛ*
‎*┋❀┃. ᴡᴇᴀᴛʜᴇʀ*
‎*┋❀┃. ғᴀɴᴄʏ*
‎*┋❀┃. ᴅᴇғɪɴᴇ*
‎*┋❀┃. ɴᴇᴡs*
‎*┋❀┃. sʀᴇᴘᴏ*
‎*┋❀┃. ɢɪᴛʜᴜʙsᴛᴀʟᴋ*
‎*┋❀┃. ᴡɪᴋɪᴘᴇᴅɪᴀ*
‎*┋❀┃. sᴀᴠᴇ*
‎*┋❀┃. ᴄᴏɪɴғʟɪᴘ*
‎*┋❀┃. ʀᴄᴏʟᴏʀ*
‎*┋❀┃. ʀᴏʟʟ*
‎*┋❀┃. ʟᴏɢᴏ*
‎*┋❀┃. ʀᴡ*
‎*┋❀┃. ᴘᴀɪʀ*
‎*┋❀┃. ᴍᴏᴠɪᴇ*
‎*┋❀╰────────────────*
‎*╰══════════════════⍟*
‎
‎*╭─❍ 𝙲𝙾𝙽𝚅𝙴𝚁𝚃𝙴𝚁 ══════⊷❍*
‎*┋❀┃. sᴛɪᴄᴋᴇʀ*
‎*┋❀┃. ᴛᴀᴋᴇ*
‎*┋❀┃. ᴇᴍᴏᴊɪᴍɪx*
‎*┋❀┃. ᴛᴛs*
‎*┋❀┃. ᴛᴏᴍᴘ3*
‎*┋❀┃. ᴛʀᴛ*
‎*┋❀┃. ʙᴀsᴇ64*
‎*┋❀┃. ᴜɴʙᴀsᴇ64*
‎*┋❀┃. ᴅʙɪɴᴀʀʏ*
‎*┋❀┃. ᴛɪɴʏᴜʀʟ*
‎*┋❀┃. ᴜʀʟ*
‎*┋❀┃. ᴜʀʟᴇɴᴄᴏᴅᴇ*
‎*┋❀┃. ᴜʀʟᴅᴇᴄᴏᴅᴇ*
‎*┋❀┃. ʀᴇᴀᴅᴍᴏʀᴇ*
‎*┋❀┃. ʀᴇᴘᴇᴀᴛ*
‎*┋❀┃. ᴀsᴋ*
‎*┋❀╰────────────────*
‎*╰══════════════════⍟*
‎
‎*╭─❍ 𝙰𝙽𝙸𝙼𝙴 ═════════⊷❍*
‎*┋❀┃. ғᴏxɢɪʀʟ*
‎*┋❀┃. ᴀɴɪᴍᴇɴᴇᴡs*
‎*┋❀┃. ɴᴀʀᴜᴛᴏ*
‎*┋❀┃. ᴅᴀʀᴇ*
‎*┋❀┃. ғᴀᴄᴋ*
‎*┋❀┃. ᴛʀᴜᴛʜ*
‎*┋❀┃. ɢᴀʀʟ*
‎*┋❀┃. ᴀᴡᴏᴏ*
‎*┋❀┃. ᴅᴏɢ*
‎*┋❀┃. ɴᴇᴋᴏ*
‎*┋❀┃. ᴡᴀɪғᴜ*
‎*┋❀┃. ʟᴏʟɪ*
‎*┋❀┃. ᴍᴀɪᴅ*
‎*┋❀┃. ᴍᴇɢɴᴜᴍɪɴ*
‎*┋❀┃. ᴀɴɪᴍᴇɢɪʀʟ*
‎*┋❀┃. ᴀɴɪᴍᴇɢɪʀʟ1*
‎*┋❀┃. ᴀɴɪᴍᴇɢɪʀʟ2*
‎*┋❀┃. ᴀɴɪᴍᴇ1*
‎*┋❀┃. ᴀɴɪᴍᴇ2*
‎*┋❀┃. ᴀɴɪᴍᴇ3*
‎*┋❀╰───────────────*
‎*╰═════════════════⍟*
‎
‎*╭─❍ 𝙰𝙸 ═══════════⊷❍*
‎*┋❀┃. ᴀɪ*
‎*┋❀┃. ɢᴘᴛ*
‎*┋❀┃. ɢᴘᴛ2*
‎*┋❀┃. ɢᴘᴛ3*
‎*┋❀┃. ᴍᴇᴛᴀ*
‎*┋❀┃. ɢᴘᴛᴍɪɴɪ*
‎*┋❀┃. ʙʟᴀᴄᴋʙᴏx*
‎*┋❀┃. ᴅᴊ*
‎*┋❀┃. ʟᴜᴍᴀ*
‎*┋❀┃. ɪᴍᴀɢɪɴᴇ*
‎*┋❀┃. ɪᴍᴀɢɪɴᴇ2*
‎*┋❀┃. ɢᴘᴛ4*
‎*┋❀┃. ᴄᴏᴘɪʟᴏᴛ*
‎*┋❀┃. ʙɪɴɢ*
‎*┋❀┃. ʀᴀʜᴍᴀɴ*
‎*┋❀╰───────────────*
‎*╰═════════════════⍟*
‎
‎*╭─❍ 𝙵𝚄𝙽 ══════════⊷❍*
‎*┋❀┃. ʜʀᴛ*
‎*┋❀┃. ᴊᴏᴋᴇ*
‎*┋❀┃. ʜʀᴛ*
‎*┋❀┃. ᴘɪᴄᴋᴜᴘ*
‎*┋❀┃. ɪɴsᴜʟᴛ*
‎*┋❀┃. sʜɪᴘ*
‎*┋❀┃. ʜᴀᴄᴋ*
‎*┋❀┃. ʜᴘʏ*
‎*┋❀┃. sʜᴀᴘᴀʀ*
‎*┋❀┃. ʀᴀᴛᴇ*
‎*┋❀┃. ᴍᴏɴ*
‎*┋❀┃. ᴋɪss*
‎*┋❀┃. ᴀɴɢᴇʀ*
‎*┋❀┃. sʜʏ*
‎*┋❀┃. ʜᴀɴᴅ*
‎*┋❀┃. ᴄᴜɴғᴜᴢᴇᴅ*
‎*┋❀┃. ɴɪᴋᴀʟ*
‎*┋❀┃. ʜᴜɢ*
‎*┋❀┃. ʜɪғɪ*
‎*┋❀┃. ᴘᴏᴋᴇ*
‎*┋❀╰───────────────*
‎*╰═════════════════⍟*
‎
‎*╭─❍ 𝙶𝚛𝚘𝚞𝚙 ════════⊷❍*
‎*┋❀┃. ɢʀᴏᴜᴘʟɪɴᴋ*
‎*┋❀┃. ᴋɪᴄᴋᴀʟʟ*
‎*┋❀┃. ᴋɪᴄᴋᴀʟʟ2*
‎*┋❀┃. ᴋɪᴄᴋ*
‎*┋❀┃. ʀᴇᴍᴏᴠᴇ*
‎*┋❀┃. ᴀᴅᴅ*
‎*┋❀┃. ᴘʀᴏᴍᴏᴛᴇ*
‎*┋❀┃. ᴅᴇᴍᴏᴛᴇ*
‎*┋❀┃. ғɪsᴍɪss*
‎*┋❀┃. sᴇᴛᴡᴇʟᴄᴏᴍᴇ*
‎*┋❀┃. sᴇᴛɢᴏᴏᴅʙʏᴇ*
‎*┋❀┃. ʀᴇᴠᴏᴋᴇ*
‎*┋❀┃. ɢɪɴғᴏ*
‎*┋❀┃. ɢᴇᴛᴘɪᴄ*
‎*┋❀┃. ᴅᴇʟᴇᴛᴇ*
‎*┋❀┃. sᴇᴛᴡᴇʟᴄᴏᴍᴇ*
‎*┋❀┃. ᴅɪsᴀᴘᴘᴇᴀʀ ᴏɴ*
‎*┋❀┃. ᴅɪsᴀᴘᴘᴇᴀʀ ᴏғғ*
‎*┋❀┃. ᴅɪsᴀᴘᴘᴇᴀʀ 7ᴅ,24ʜ*
‎*┋❀┃. ᴜᴘᴅᴀᴛᴇɢɴᴀᴍᴇ*
‎*┋❀┃. ᴜᴘᴅᴀᴛᴇɢᴅᴇsᴄ*
‎*┋❀┃. ᴊᴏɪɴʀᴇϙᴜᴇsᴛs*
‎*┋❀┃. sᴇɴᴅᴅᴍ*
‎*┋❀┃. ᴍᴜᴛᴇ*
‎*┋❀┃. ᴜɴᴍᴜᴛᴇ*
‎*┋❀┃. ᴊᴏɪɴʀᴇϙᴜᴇsᴛs*
‎*┋❀┃. sᴇɴᴅᴅᴍ*
‎*┋❀┃. ᴍᴜᴛᴇ*
‎*┋❀┃. ᴜɴᴍᴜᴛᴇ*
‎*┋❀┃. ɪɴᴠɪᴛᴇ*
‎*┋❀┃. ʟᴏᴄᴋɢᴄ*
‎*┋❀┃. ᴜɴʟᴏᴄᴋɢᴄ*
‎*┋❀┃. ᴛᴀɢ*
‎*┋❀┃. ʜɪᴅᴇᴛᴀɢ*
‎*┋❀┃. ᴛᴀɢᴀʟʟ*
‎*┋❀┃. ᴛᴀɢᴀᴅᴍɪɴs*
‎*┋❀╰────────────────*
‎*╰══════════════════⍟*
‎
‎*╭─❍ 𝚁𝙴𝙰𝙲𝚃𝙸𝙾𝙽𝚂 ══════⊷❍*
‎*┋❀┃. ᴄʀɪɴɢᴇ*
‎*┋❀┃. ᴡɪɴᴋ*
‎*┋❀┃. ᴘᴏᴋᴇ*
‎*┋❀┃. ᴅᴀɴᴄᴇ*
‎*┋❀┃. sʟᴀᴘ*
‎*┋❀┃. ᴋɪʟʟ*
‎*┋❀┃. ʜᴀᴘᴘʏ*
‎*┋❀┃. ɴᴏᴍ*
‎*┋❀┃. ʙɪᴛᴇ*
‎*┋❀┃. ɢʟᴏᴍᴘ*
‎*┋❀┃. ʜɪɢʜғɪᴠᴇ*
‎*┋❀┃. ʜᴀɴᴅʜᴏʟᴅ*
‎*┋❀┃. ɴᴏᴍ*
‎*┋❀┃. ʙʟᴜsʜ*
‎*┋❀┃. sᴍɪʟᴇ*
‎*┋❀┃. ᴡᴀᴠᴇ*
‎*┋❀┃. sᴍᴜɢ*
‎*┋❀┃. ʙᴏɴᴋ*
‎*┋❀┃. ʏᴇᴇᴛ*
‎*┋❀┃. ᴋɪss*
‎*┋❀┃. ʟɪᴄᴋ*
‎*┋❀┃. ᴘᴀᴛ*
‎*┋❀┃. ʜᴜɢ*
‎*┋❀┃. ᴀᴡᴏᴏ*
‎*┋❀┃. ᴄʀʏ*
‎*┋❀┃. ʙᴜʟʟʏ*
‎*┋❀┃. ᴄᴜᴅᴅʟᴇ*
‎*┋❀╰───────────────*
‎*╰═════════════════⍟*
‎‎`;

        await conn.sendMessage(
            from,
            {
                image: { url: config.MENU_IMAGE_URL || 'https://files.catbox.moe/t3p1at.jpg' },
                caption: dec,
                contextInfo: {
                    mentionedJid: [m.sender],
                    forwardingScore: 999,
                    isForwarded: true,
                    forwardedNewsletterMessageInfo: {
                        newsletterJid: '120363201214007503@newsletter',
                        newsletterName: config.BOT_NAME,
                        serverMessageId: 143
                    }
                }
            },
            { quoted: mek }
        );
// share local audio 

const audioPath = path.join(__dirname, '../assets/menu.m4a');
await conn.sendMessage(from, {
    audio: fs.readFileSync(audioPath),
    mimetype: 'audio/mp4',
    ptt: true,
}, { quoted: mek });
        
    } catch (e) {
        console.log(e);
        reply(`❌ Error: ${e}`);
    }
});
